app/Services/TwilioService.php

    public function sendSMS($to, $message)
    {
        $settings = GlobalSettings::first();
---
select * from `global_settings` limit 1