app/Http/Controllers/Api/AuthController.php

    public function register_device(Request $request)
    {
        $userid     = $request->user_id;
        $device_id  = $request->device_id;
        $fcm_token  = $request->fcm_token;
        $device_name  = $request->device_name;
        $device_manufacture  = $request->device_manufacture;
        $device_model  = $request->device_model;
        $os_ver     = $request->os_ver;
        $device_os  = $request->device_os;
        $app_ver    = $request->app_ver;

        $checkuser = User::where('id', $userid)->first();

        $check_user = Device::where('user_id', $userid)->where('device_id', $device_id)->first();
        if(!empty($check_user)){

            Device::where('user_id', $userid)->where('device_id', $device_id)->update([
                'fcm_token'          => $fcm_token,
                'app_ver'            => $app_ver,
                'device_name'        => $device_name,
                'device_manufacture' => $device_manufacture,
                'device_model'       => $device_model,
                'os_ver'             => $os_ver,
                'device_os'          => $device_os,
                'language'           => $check_user->language
            ]);

            Device::where('device_id', $device_id)->whereNull('user_id')->delete();
            Device::where('device_id', $device_id)->whereNull('fcm_token')->delete();
---
select * from `users` where `id` = '2' limit 1
select * from `devices` where `user_id` = '2' and `device_id` = 'QP1A.190711.020' limit 1
update `devices` set `fcm_token` = 'eH13L9yLR5WqJha4VW1IuG:APA91bHZIRQMnYEhbS1OZPfVKtc4kcNuZtp-1N1_O1hzQkL9zqZ-Okv4exdeCyzHXto5TH4emuCv0glbGLkOI-EZWIvySSQbKHrrCbyKzhP8GJxfKktSyR2wWAT8KX7NMXX7j5QjoGya', `app_ver` = '1.0.2', `device_name` = 'SM-M205F', `device_manufacture` = 'samsung', `device_model` = 'm20lte', `os_ver` = '10', `device_os` = 'android', `language` = '1', `devices`.`updated_at` = '2024-07-03 05:43:03' where `user_id` = '2' and `device_id` = 'QP1A.190711.020'
delete from `devices` where `device_id` = 'QP1A.190711.020' and `user_id` is null
delete from `devices` where `device_id` = 'QP1A.190711.020' and `fcm_token` is null

            return response()->json(['status' => false, 'message' => 'Device updated successfully']);
        }else{

            $check_device = Device::where('user_id', $userid)->first();
            if(!empty($check_device)){
                Device::where('user_id', $userid)->update([
                    'fcm_token'          => null,
                    'user_id'            => null,
                ]);

                Device::where('device_id', $device_id)->update([
                    'fcm_token'          => null,
                    'user_id'            => null,
                ]);

                Device::insert([
                    'user_id'            => $userid,
                    'device_id'          => $device_id,
                    'fcm_token'          => $fcm_token,
                    'app_ver'            => $app_ver,
                    'device_name'        => $device_name,
                    'device_manufacture' => $device_manufacture,
                    'device_model'       => $device_model,
                    'os_ver'             => $os_ver,
                    'device_os'          => $device_os,
                    'language'           => $check_device->language
                ]);

                Device::whereNull('user_id')->delete();
                Device::whereNull('fcm_token')->delete();
---
select * from `devices` where `user_id` = '2' limit 1
update `devices` set `fcm_token` = '', `user_id` = '', `devices`.`updated_at` = '2024-07-03 01:48:34' where `user_id` = '2'
update `devices` set `fcm_token` = '', `user_id` = '', `devices`.`updated_at` = '2024-07-03 01:48:34' where `device_id` = 'QP1A.190711.020'
insert into `devices` (`user_id`, `device_id`, `fcm_token`, `app_ver`, `device_name`, `device_manufacture`, `device_model`, `os_ver`, `device_os`, `language`) values ('2', 'QP1A.190711.020', 'ezhjMkFaRA-aTiMc8nJMft:APA91bH-fJIvn9-mKid6y_x96rUkKPdsmK-Btd6hsG0WnEV8EI3oAOBRIOTb1yPv_9us0xV3Pp_psKhwTUYy3Kg7PBgl9MkUJnMshlbWCOLMLR0r1Rn5eti-QmSLJiD-uGfNgKDDEQeT', '1.0.2', 'SM-M205F', 'samsung', 'm20lte', '10', 'android', '1')
delete from `devices` where `user_id` is null
delete from `devices` where `fcm_token` is null

    public function send_otp(Request $request)
    {
        $rules= [
            'phone' => 'required',
            'email'=> 'required',
        ];

        $validator = Validator::make($request->all(), $rules);
        if ($validator->fails()) {
            $messages = $validator->errors()->all();
            $msg = $messages[0];
            return response()->json(['status' => false, 'message' => $msg]);
        }

        try{
            $otp = rand(111111,999999);
            $message = "Your verification code for Isidel Beach Park is ".$otp;

            $response = $this->twilioService->sendSMS($request->phone, $message);
            if($response->sid) {
                $data['phone'] = $request->phone;
                $data['otp'] = $otp;
                $data['verified'] = 0;

                DB::table("phone_verification")->insert($data);

                $bookingsuccesemail=EmailTemplate::find(7);
---
insert into `phone_verification` (`phone`, `otp`, `verified`) values ('+918950291871', 603316, 0)
select * from `email_template` where `email_template`.`id` = 7 limit 1

    public function login(Request $request)
    {
        $rules= [
            'email' => 'required',
            'password' => 'required',
        ];

        $validator = Validator::make($request->all(), $rules);
        if ($validator->fails()) {
            $messages = $validator->errors()->all();
            $msg = $messages[0];
            return response()->json(['status' => false, 'message' => $msg]);
        }

        $email      = $request->email;
        $password   = $request->password;
        $device_id  = $request->device_id;
        $fcm_token  = $request->fcm_token;
        $device_name  = $request->device_name;
        $device_manufacture  = $request->device_manufacture;
        $device_model  = $request->device_model;
        $os_ver     = $request->os_ver;
        $device_os  = $request->device_os;
        $app_ver    = $request->app_ver;

        try{
            if (strpos($email, '@') !== false){
                $user = User::where('email', $email)->first();
---
select * from `users` where `email` = 'Kishan@gmail.com' limit 1


            if(Auth::attempt(['email' => $user->email, 'password' => $password]))
            {
                $check_device = Device::where('user_id', $user->id)->where('device_id', $device_id)->first();
---
select * from `devices` where `user_id` = 2 and `device_id` = 'QP1A.190711.020' limit 1

                    'language'           => $language
                ]);

                User::where('id', $user->id)->update([
                    'last_login_at' => $request->last_login_at,
                    'last_login_ip' => $request->ip(),
                ]);

                $fullName                  = $user->first_name . ' ' . $user->last_name;
                $accessToken               = DB::table('personal_access_tokens')->where('tokenable_id', $user->id);
                $getAccessToken            = $accessToken->first();
---
update `users` set `last_login_at` = '2023-12-13 19:41:44', `last_login_ip` = '122.161.49.119', `users`.`updated_at` = '2024-07-03 05:20:34' where `id` = 2
select * from `personal_access_tokens` where `tokenable_id` = 2 limit 1

    public  function get_countries()
    {
        $countries = Country::where('status', '1')->get();
---
select * from `countries` where `status` = '1'