app/Http/Controllers/Api/BookingsController.php

    function place_booking(Request $request)
    {
        $rules = [
            'user_id' => 'required',
            'salon_id' => 'required',
            'service_id'=>'required',
            'date' => 'required',
            'time' => 'required',
            'duration' => 'required',
            'services' => 'required',
            'is_coupon_applied' => [Rule::in(1, 0)],
            'service_amount' => 'required',
            'discount_amount' => 'required',
            'subtotal' => 'required',
            'total_tax_amount' => 'required',
            'payable_amount' => 'required',
        ];

        $validator = Validator::make($request->all(), $rules);
        if ($validator->fails()) {
            $messages = $validator->errors()->all();
            $msg = $messages[0];
            return response()->json(['status' => false, 'message' => $msg]);
        }

        $settings = GlobalSettings::first();
        $taxes=Taxes::first();

        $user = Users::find($request->user_id);
---
select * from `global_settings` limit 1
select * from `taxes` limit 1
select * from `users` where `users`.`id` = '5' limit 1

            return response()->json(['status' => false, 'message' => "User doesn't exists!"]);
        }

        $bookingsCount = Bookings::where('user_id', $user->id)
            ->whereIn('status', [Constants::orderPlacedPending, Constants::orderAccepted])
            ->count();
---
select count(*) as aggregate from `bookings` where `user_id` = 5 and `status` in (0, 1)

            return response()->json(['status' => false, 'message' => "Maximum at a time order limit reached!"]);
        }

        $salon = Salons::find($request->salon_id);
---
select * from `salon` where `salon`.`id` = '1' limit 1

        $booking->save();

        $user->wallet = $user->wallet - $request->payable_amount;
        $user->save();
---
update `users` set `wallet` = 1573.75, `users`.`updated_at` = '2024-07-03 08:58:26' where `id` = 5

            null
        );

        $booking = Bookings::where('id', $booking->id)->first();
---
select * from `bookings` where `id` = 70 limit 1

            $item_price= $settings->currency.number_format($request->service_amount,2);
            $amount= $settings->currency.number_format($request->payable_amount,2);

            $check_device = Device::where('user_id', $user->id)->first();
---
select * from `devices` where `user_id` = 5 limit 1

                $act_lang = '1';
            }

            $email_template = EmailTemplate::find(1);
---
select * from `email_template` where `email_template`.`id` = 1 limit 1

            send_email($details);

            $superAdmin=Admin::where('user_type',1)->first();
            $adminbookingsuccesemail=AdminEmailTemplate::find(1);
---
select * from `admin_email_template` where `admin_email_template`.`id` = 1 limit 1


            $type="booking";

            $notification_template = NotificationTemplate::find(2);
---
select * from `notification_template` where `notification_template`.`id` = 2 limit 1


            GlobalFunction::sendPushToUser($title, $message, $user);

            $adminNotification=AdminNotificationTemplate::find(2);
---
select * from `admin_notification_template` where `admin_notification_template`.`id` = 2 limit 1

    function booking_details(Request $request)
    {
        $rules = [
            'booking_id' => 'required',
            'user_id' => 'required',
        ];

        $validator = Validator::make($request->all(), $rules);
        if ($validator->fails()) {
            $messages = $validator->errors()->all();
            $msg = $messages[0];
            return response()->json(['status' => false, 'message' => $msg]);
        }

        if($request->lan_id=="pap"){
            $title=  "title_in_papiamentu as title";
            $rules=  "rules_in_papiamentu as rules";
            $about=  "about_in_papiamentu as about";
        }elseif($request->lan_id=="nl"){
            $title=  "title_in_dutch as title";
            $rules=  "rules_in_dutch as rules";
            $about=  "about_in_dutch as about";
        }else{
            $title=  "title as title";
            $rules=  "rules as rules";
            $about=  "about as about";
        }

        $booking = Bookings::where('booking_id', $request->booking_id)->with(['salon', 'user', 'review', 'salon.images', 'salon.slots','service.slots','service'=>function($query) use ($title,$rules,$about,$request) {
            if($request->user_type == 1){
                $query->select(['id','latitude','logintude','salon_id','rating','thumbnail',$title,'service_time','service_number',$about,$rules,'qauntity','foreiner_price as price','foreiner_price_per_day as price_per_day','foreiner_discount as discount','local_cancellation_charges as cancellation_charge']) ;
            }else{
                $query->select(['id','latitude','logintude','salon_id','rating','thumbnail',$title,'service_time','service_number',$about,$rules,'qauntity','price','price_per_day','discount','local_cancellation_charges as cancellation_charge']);
            }
        }])->first();
---
select * from `salon` where `salon`.`id` in (1)
select * from `users` where `users`.`id` in (2)

        $booking['service_image'] = url('storage/'.$service_image->thumbnail);
        $booking['invoice_url'] = route('booking.invoice', $booking->id);

        $booking->refund_details=UserWalletStatements::where('type',3)->where('booking_id',$request->booking_id)->first();
---
select * from `user_wallet_statement` where `type` = 3 and `booking_id` = 'BCJA880893LGS' limit 1

    function all_bookings(Request $request)
    {
        $rules = [
            'user_id' => 'required',
            'start' => 'required',
            'count' => 'required',
        ];

        $validator = Validator::make($request->all(), $rules);
        if ($validator->fails()) {
            $messages = $validator->errors()->all();
            $msg = $messages[0];
            return response()->json(['status' => false, 'message' => $msg]);
        }

        $user = Users::find($request->user_id);
        if ($user == null) {
            return response()->json(['status' => false, 'message' => "User doesn't exists!"]);
        }

        $bookings = Bookings::with(['salon', 'salon.images', 'user'])
            ->where('user_id', $user->id)
            ->offset($request->start)
            ->limit($request->count)
            ->orderBy('id', 'DESC')
            ->get();
---
select * from `users` where `users`.`id` = '2' limit 1
select * from `bookings` where `user_id` = 2 order by `id` desc limit 10 offset 0
select * from `salon` where `salon`.`id` in (1)
select * from `users` where `users`.`id` in (2)

    function bookings_by_date(Request $request)
    {
        $rules = [
            'service_id' => 'required',
            'date' => 'required',
        ];

        $validator = Validator::make($request->all(), $rules);
        if ($validator->fails()) {
            $messages = $validator->errors()->all();
            $msg = $messages[0];
            return response()->json(['status' => false, 'message' => $msg]);
        }

        $salon = Services::where('id', $request->service_id)->first();
        if ($salon == null) {
            return response()->json(['status' => false, 'message' => "Service doesn't exists!"]);
        }

        $bookings = Bookings::where('service_id', $request->service_id)
            ->where('date', $request->date)
            ->whereIn('status', [Constants::orderPlacedPending, Constants::orderAccepted])
            ->with(['user'])
            ->get();
---
select * from `bookings` where `service_id` = '25' and `date` = '2024-7-3' and `status` in (0, 1)