app/Http/Controllers/Api/HomeController.php

    function home_data(Request $request)
    {
        if($request->lan_id=="pap"){
            $title=  "title_in_papiamentu as title";
            $rules=  "rules_in_papiamentu as rules";
            $about=  "about_in_papiamentu as about";
        }elseif($request->lan_id=="nl"){
            $title=  "title_in_dutch as title";
            $rules=  "rules_in_dutch as rules";
            $about=  "about_in_dutch as about";
        }else{
            $title=  "title as title";
            $rules=  "rules as rules";
            $about=  "about as about";
        }

        $banners = Banners::orderBy('id', 'DESC')->get();

        $categories = SalonCategories::select(['id',$title,'parent','icon','is_deleted','sort','status','created_at','updated_at'])->where('status',1)->where('is_deleted', 0)->orderBy('sort','asc')->get();

        $categoriesWithServices = SalonCategories::select(['id',$title,'parent','icon','is_deleted','sort','status','created_at','updated_at'])->where('status',1)->where('is_deleted', 0)->orderBy('sort','asc')->get();

        $salonsTopRated = Salons::with(['images', 'slots'])
            ->where('top_rated', 1)
            ->where('on_vacation', 0)
            ->where('status', Constants::statusSalonActive)
            ->inRandomOrder()
            ->get();
---
select * from `banners` order by `id` desc
select `id`, `title` as `title`, `parent`, `icon`, `is_deleted`, `sort`, `status`, `created_at`, `updated_at` from `salon_categories` where `status` = 1 and `is_deleted` = 0 order by `sort` asc
select * from `salon` where `top_rated` = 1 and `on_vacation` = 0 and `status` = 1 order by RAND()

        }

        if($request->user_type==1){
            $servicesTopRated = Services::select(['id','latitude','logintude','salon_id','rating','thumbnail',$title,'service_time','qauntity','service_number',$about,$rules,'qauntity','foreiner_price as price','foreiner_price_per_day as price_per_day','foreiner_discount as discount'])->where('status',1)->with(['images','slots','salon','salon.images','salon.gallery','reviews'])->orderBy('rating','desc')->latest()->get();
        }else{
            $servicesTopRated = Services::select(['id','salon_id','latitude','logintude','rating','thumbnail',$title,'service_time','qauntity','service_number',$about,$rules,'qauntity','price','price_per_day','discount'])->where('status',1)->with(['images','slots','salon','salon.images','salon.gallery','reviews'])->orderBy('rating','desc')->latest()->get();
---
select * from `salon` where `salon`.`id` in (1)


        foreach ($categories as $cat) {
            if($request->user_type==1){
                $services = Services::select(['id','latitude','logintude','salon_id','rating','thumbnail',$title,'service_time','service_number',$about,$rules,'qauntity','foreiner_price as price','foreiner_price_per_day as price_per_day','foreiner_discount as discount'])->where('category_id', $cat->id)->where('status',1)->with(['images','slots','salon','salon.images','salon.gallery','reviews'])->latest()->get();
            }else{
                $services = Services::select(['id','latitude','logintude','salon_id','rating','thumbnail',$title,'service_time','service_number',$about,$rules,'qauntity','price','price_per_day','discount'])->where('category_id', $cat->id)->where('status',1)->with(['images','slots','salon','salon.images','salon.gallery','reviews'])->latest()->get();
---
select * from `salon` where `salon`.`id` in (1)


        foreach ($categoriesWithServices as $cat) {
            if($request->user_type==1){
                $services = Services::select(['id','latitude','logintude','salon_id','rating','thumbnail',$title,'service_time','service_number',$about,$rules,'qauntity','foreiner_price as price','foreiner_price_per_day as price_per_day','foreiner_discount as discount'])->where('category_id', $cat->id)->where('status',1)->with(['images','slots','salon','salon.images','salon.gallery','reviews'])->latest()->get();
            }else{
                $services = Services::select(['id','latitude','logintude','salon_id','rating','thumbnail',$title,'service_time','service_number',$about,$rules,'qauntity','price','price_per_day','discount'])->where('category_id', $cat->id)->where('status',1)->with(['images','slots','salon','salon.images','salon.gallery','reviews'])->latest()->get();
---
select * from `salon` where `salon`.`id` in (1)

    function search_by_coordinates(Request $request)
    {
        $rules = [
            'lat' => 'required',
            'long' => 'required',
            'km' => 'required',
        ];

        $validator = Validator::make($request->all(), $rules);
        if ($validator->fails()) {
            $messages = $validator->errors()->all();
            $msg = $messages[0];
            return response()->json(['status' => false, 'message' => $msg]);
        }

        $salons = Salons::with(['images', 'slots'])
            ->where('on_vacation', 0)
            ->where('status', Constants::statusSalonActive)
            ->get();
---
select * from `salon` where `on_vacation` = 0 and `status` = 1

        foreach ($salons as $salon) {
            $distance = GlobalFunction::point2point_distance($request->lat, $request->long, $salon->salon_lat, $salon->salon_long, "K", $request->km);

            $categories = SalonCategories::whereIn('id', explode(',', $salon->salon_categories))->orderBy('sort','asc')->get();
---
select * from `salon_categories` where `id` in ('') order by `sort` asc

    function get_settings(Request $request)
    {
        $rules = [
            'user_id' => 'required',
            'lan_id' => 'required',
        ];

        $validator = Validator::make($request->all(), $rules);
        if ($validator->fails()) {
            $messages = $validator->errors()->all();
            $msg = $messages[0];
            return response()->json(['status' => false, 'message' => $msg]);
        }

        $settings = GlobalSettings::first();
        $categories = SalonCategories::where('is_deleted', 0)->orderBy('sort','asc')->get();
        $taxes = Taxes::where('status', 1)->get();
        $fee=Fee::get();
---
select * from `global_settings` limit 1
select * from `salon_categories` where `is_deleted` = 0 order by `sort` asc
select * from `taxes` where `status` = 1
select * from `fees`