app/Http/Controllers/Api/PageController.php

select * from `pages` where `type` != '1' and `status` = '1'
---
    public function get_pages(Request $request)
    {
        $rules = [
            'lan_id' => 'required',
        ];

        $validator = Validator::make($request->all(), $rules);
        if ($validator->fails()) {
            $messages = $validator->errors()->all();
            $msg = $messages[0];
            return response()->json(['status' => false, 'message' => $msg]);
        }

        $lang = $request->lan_id;

        if(!empty($lang)){
            $title_lang = $lang.'_title';
            $desc_lang = $lang.'_description';
        }else{
            $title_lang = 'en_title';
            $desc_lang = 'en_description';
        }

        $pages = Page::where('type', '!=', '1')->where('status', '1')->get();