app/Http/Controllers/Api/ProfileController.php

    function langauage_contents(Request $request)
    {
        $device = Device::where('device_id', $request->device_id)->first();
        if (empty($device)) {
            $device_lang = '1';
        }else{
            $device_lang = $device->language;
        }

        $language = Language::where('id', $device_lang)->first();
        $lang = $language->short_name;
        $languages = LanguageContent::select('string', $lang)->where('active', '1')->get();
---
select * from `devices` where `device_id` = 'QP1A.190711.020' limit 1
select * from `languages` where `id` = '1' limit 1
select `string`, `en` from `language_contents` where `active` = '1'

    public function check_app_update(Request $request)
    {
        $rules = [
            'platform' => 'required',
            'app_ver' => 'required'
        ];

        $validator = Validator::make($request->all(), $rules);
        if ($validator->fails()) {
            $messages = $validator->errors()->all();
            $msg = $messages[0];
            return response()->json(['status' => false, 'message' => $msg]);
        }

        $platform = $request->platform;
        $app_ver = $request->app_ver;

        $settings = GlobalSettings::first();
---
select * from `global_settings` limit 1