app/Http/Controllers/Api/ServiceController.php

        }

        if($request->user_type==1){
            $service = Services::select(['id','latitude','logintude','service_type',$included_items,'salon_id','category_id','rating','thumbnail',$title,$history,'service_time','service_number',$about,$rules,'qauntity','foreiner_price as price','foreiner_price_per_day as price_per_day','foreiner_discount as discount'])->where('id',$request->service_id)->where('status',1)->with(['images','map_images','slots','salon','salon.images','salon.gallery','reviews'])->first();
---
select * from `salon` where `salon`.`id` in (1)