app/helpers.php

select * from `users` where `id` is null limit 1
---
function getUserDetails($userId=null){

    $user_details=Users::where('id',$userId)->first();

select * from `user_notifications` where `user_id` is null or `notification_type` = 'promotional' order by `id` desc limit 5
---
    function fetchNotification()
    {
        $user_id = Session::get('user_id');
        $notifications = UserNotification::where('user_id',$user_id)->orWhere('notification_type','promotional')->limit(5)->orderBy('id', 'DESC')->get();

select `id` from `permissions` where `name` in ('add_bookings')
select `role_id` from `permission_role` where (`role_id` = 1 and `permission_id` = 14) limit 1
---
    function has_permission($role_id, $permissions)
    {
        $permissions = explode('|', $permissions);

        $permission_id = [];
        $i             = 0;

        $user_type = 'Admin';

        $userPermissions = Permission::whereIn('name', $permissions)->get(['id']);

        foreach ($userPermissions as $value)
        {
            $permission_id[$i++] = $value->id;
        }
        $role = PermissionRole::where(['role_id' => $role_id, 'permission_id' => $permission_id])->first(['role_id']);

select * from `email_configs` limit 1
---
    function send_email($details)
    {
        $settings = EmailConfig::first();