app/Http/Controllers/Web/AuthController.php

    public function user_login(Request $request)
    {
        $rules = [
            'email' => 'required',
            'password' => 'required',
        ];

        $validator = Validator::make($request->all(), $rules);
        if ($validator->fails()) {
            $messages = $validator->errors()->all();
            $msg = $messages[0];
            return back()->with(['status' => false, 'message' => $msg])->withInput();
        }

        $checkEmail=Users::where('email',$request->email)->first();
        $msg="Invalid Email or Password";
        if(empty($checkEmail)){
            return back()->with(['status' => false, 'message' => $msg])->withInput();
        }

        $remember_me = $request->has('remember_token') ? true : false;

        if (Auth::attempt(["email"=>$request->email,'password'=>$request->password],$remember_me)){
            Session::put('user_id',$checkEmail->id);
            Session::put('user_type',$checkEmail->user_type);
            Session::put('user_name',$checkEmail->first_name);

            $current_time = Carbon::now()->format('d-M-Y H:i:s');
            $browser = $this->getBrowser();

            UsersLoginLocation::create([
                'user_id'       => $checkEmail->id,
                'ip_address'    => $request->ip(),
                'browser'       => $browser['name'],
                'version'       => $browser['version'],
                'platform'      => $browser['platform'],
            ]);

            Users::where('id', $checkEmail->id)->update([
                'last_login_at' => $current_time,
                'last_login_ip' => $request->ip(),
            ]);
---
select * from `users` where `email` = 'bhawesh.smd@gmail.com' limit 1
insert into `users_login_location` (`user_id`, `ip_address`, `browser`, `version`, `platform`, `updated_at`, `created_at`) values (1, '122.161.49.119', 'Google Chrome', '126.0.0.0', 'windows', '2024-07-03 02:46:16', '2024-07-03 02:46:16')
update `users` set `last_login_at` = '03-Jul-2024 02:46:16', `last_login_ip` = '122.161.49.119', `users`.`updated_at` = '2024-07-03 02:46:16' where `id` = 1