app/Http/Controllers/Web/ChatController.php

select * from `chat_messages` where (`sender` = '1' and `receiver` = 1) or (`sender` = 1 and `receiver` = '1')
---
    public function get_message(Request $request, $userid)
    {
        $data['username'] = $username = Admin::where('user_id', '1')->first();
        $data['my_id'] = $my_id = $username->user_id;

        ChatMessage::where(['sender' => $userid, 'receiver' => $my_id])->update(['read' => 1]);
        ChatMessage::where(['receiver' => $userid, 'sender' => $my_id])->update(['read' => 1]);

        $data['messages'] = ChatMessage::where(function ($query) use ($userid, $my_id) {
            $query->where('sender', $userid)->where('receiver', $my_id);
        })->oRwhere(function ($query) use ($userid, $my_id) {
            $query->where('sender', $my_id)->where('receiver', $userid);
        })->get();