app/Http/Controllers/Web/HomeController.php

select * from `global_settings` limit 1
select `id`, `title` as `title`, `slug`, `parent`, `is_deleted`, `status`, `sort`, `web_icon`, `icon` from `salon_categories` where `status` = 1 and `is_deleted` = 0 and `parent` is null order by `sort` asc
select * from `web_banners` order by `id` desc limit 1
select * from `faqs` where `status` = '1' limit 5
---
    public function index(Request $request)
    {
        $settings = GlobalSettings::first();

        if(session()->get('locale')=="pap"){
            $title=  "title_in_papiamentu as title";
            $rules=  "rules_in_papiamentu as rules";
            $about=  "about_in_papiamentu as about";
        }elseif(session()->get('locale')=="nl"){
            $title=  "title_in_dutch as title";
            $rules=  "rules_in_dutch as rules";
            $about=  "about_in_dutch as about";
        }else{
            $title=  "title as title";
            $rules=  "rules as rules";
            $about=  "about as about";
        }

        if(Session::get('user_type')){
            $service = Services::select(['id','latitude','logintude',$title,'thumbnail','slug','category_id','rating','service_number','service_time',$about,$rules,'qauntity','foreiner_price as price','foreiner_price_per_day as price_per_day','foreiner_discount as discount'])->where('status',1)->with(['images','slots','reviews','category'])->orderBy('rating','DESC')->get();
        }else{
            $service = Services::select(['id','latitude','logintude',$title,'service_number','slug','category_id','rating','thumbnail','service_time',$about,$rules,'qauntity','price','price_per_day','discount'])->where('status',1)->with(['images','slots','reviews','category'])->orderBy('rating','DESC')->get();
        }

        $data['categories']=SalonCategories::select(['id',$title,'slug','parent','is_deleted','status','sort','web_icon','icon'])->where('status',1)->where('is_deleted',0)->where('parent',null)->orderBy('sort','asc')->get();

        $data['featured_facilities'] = $service;
        $data['settings'] = $settings;
        $data['banner'] = WebBanner::orderBy('id', 'desc')->first();

        $data['lang'] = session()->get('locale');
        $data['faqs'] = Faqs::where('status', '1')->limit(5)->get();

select * from `salon` limit 1
select * from `global_settings` limit 1
---
    public function contact_us(Request $request)
    {
        $data['company_details'] = Salons::first();
        $data['settings'] = GlobalSettings::first();