app/Http/Controllers/Web/WebController.php

select * from `users` where `id` = 1 limit 1
select * from `global_settings` limit 1
select * from `bookings` where `user_id` = 1 order by `created_at` desc limit 5
select * from `salon` where `salon`.`id` in (1)
select * from `users` where `users`.`id` in (1)
select count(*) as aggregate from `bookings` where `user_id` = 1
select sum(`amount`) as aggregate from `user_wallet_statement` where `user_id` = 1
select sum(`payable_amount`) as aggregate from `bookings` where `user_id` = 1
select * from `users` where `users`.`id` in (6)
---
    public function user_dashboard(Request $request)
    {
        $user_id=Session::get('user_id');
        $userDetails=Users::where('id',$user_id)->first();
        $data['settings'] = GlobalSettings::first();
        $data['allbookings'] = Bookings::with(['user', 'salon','service','service.category'])->where('user_id',$user_id)->latest()->limit(5)->get();
        $data['allbookingsCount'] = Bookings::with(['user', 'salon','service','service.category'])->where('user_id',$user_id)->count();
        $data['total_transaction'] = UserWalletStatements::with(['user'])->where('user_id',$user_id)->sum('amount');
        $data['total_bookings']=Bookings::where('user_id', $user_id)->sum('payable_amount');

        $favourite_services=explode(',',$userDetails->favourite_services);

        if(session()->get('locale')=="pap"){
            $title=  "title_in_papiamentu as title";
            $rules=  "rules_in_papiamentu as rules";
            $about=  "about_in_papiamentu as about";
        }elseif(session()->get('locale')=="nl"){
            $title=  "title_in_dutch as title";
            $rules=  "rules_in_dutch as rules";
            $about=  "about_in_dutch as about";
        }else{
            $title=  "title as title";
            $rules=  "rules as rules";
            $about=  "about as about";
        }

        if(Session::get('user_type')){
            $service = Services::select(['id','latitude','logintude',$title,'thumbnail','category_id','rating','slug','service_number','service_time',$about,$rules,'qauntity','foreiner_price as price','foreiner_price_per_day as price_per_day','slug','foreiner_discount as discount'])->where('status',1)->whereIn('id',$favourite_services)->with(['images','slots','reviews','reviews.user'])->limit(5)->get();
        }else{
            $service = Services::select(['id','latitude','logintude',$title,'service_number','category_id','rating','slug','thumbnail','service_time',$about,$rules,'qauntity','price','price_per_day','discount','slug'])->where('status',1)->whereIn('id',$favourite_services)->with(['images','slots','reviews','reviews.user'])->limit(5)->get();