app/Models/GlobalFunction.php

select * from `global_settings` limit 1
select * from `devices` where `user_id` = 5 limit 1
---
    public static function sendPushToUser($title, $message, $user)
    {
        if ($user->is_notification == 1) {
            $setting = GlobalSettings::first();
            $userdevices = Device::where('user_id', $user->id)->first();

select count(*) as aggregate from `bookings` where `booking_id` = 'BBRO915599LCL'
---
    public static function generateBookingId()
    {
        $token =  rand(100000, 999999);

        $first = Constants::prefixBookingId;
        $first .= GlobalFunction::generateRandomString(3);
        $first .= $token;
        $first .= GlobalFunction::generateRandomString(3);
        $count = Bookings::where('booking_id', $first)->count();

insert into `user_wallet_statement` (`transaction_id`, `user_id`, `booking_id`, `amount`, `charge_percent`, `charge_amount`, `total_amount`, `cr_or_dr`, `type`, `summary`, `updated_at`, `created_at`) values ('TNCR145690ZGU', 5, 'BBRO915599LCL', '10.6', '', '', '', 0, 1, '', '2024-07-03 08:58:26', '2024-07-03 08:58:26')
---
    public static function addUserStatementEntry($userId, $bookingId, $amount, $crOrDr, $type, $summary,$charge_percent=null,$charge_amount=null,$total_amount=null)
    {
        $stmt = new UserWalletStatements();
        $stmt->transaction_id = GlobalFunction::generateTransactionId();
        $stmt->user_id = $userId;
        $stmt->booking_id = $bookingId;
        $stmt->amount = $amount;
        $stmt->charge_percent = $charge_percent;
        $stmt->charge_amount = $charge_amount;
        $stmt->total_amount = $total_amount;
        $stmt->cr_or_dr = $crOrDr;
        $stmt->type = $type;
        $stmt->summary = $summary;
        $stmt->save();

select count(*) as aggregate from `user_wallet_statement` where `transaction_id` = 'TNCR145690ZGU'
---
    public static function generateTransactionId()
    {
        $token =  rand(100000, 999999);
        $first = Constants::prefixUserTransactionId;
        $first .= GlobalFunction::generateRandomString(3);
        $first .= $token;
        $first .= GlobalFunction::generateRandomString(3);
        $count = UserWalletStatements::where('transaction_id', $first)->count();