app/Http/Controllers/Admin/AdminsController.php

select * from `admin_user` where `user_name` = 'admin' limit 1
select * from `roles` where `id` = 1 limit 1
---
    public function profile()
    {
        $admin = DB::table('admin_user')->where('user_name', session()->get('user_name'))->first();
        $role = Role::where('id', $admin->user_type)->first();

select * from `global_settings` limit 1
select * from `cards` where `assigned_to` is null
select * from `cards` where `assigned_to` is not null
select * from `users` where `is_block` != '1' and `card_id` is null order by `first_name` asc
select count(*) as aggregate from `salon` where `status` = 0
select count(*) as aggregate from `salon` where `status` = 1
select count(*) as aggregate from `salon` where `status` = 2
select count(*) as aggregate from `salon` where `status` = -1
select count(*) as aggregate from `bookings` where date(`created_at`) = '2024-07-03'
select count(*) as aggregate from `bookings` where date(`created_at`) = '2024-07-03' and `status` = 0
select count(*) as aggregate from `bookings` where date(`created_at`) = '2024-07-03' and `status` = 1
select count(*) as aggregate from `bookings` where date(`created_at`) = '2024-07-03' and `status` = 2
select count(*) as aggregate from `bookings` where date(`created_at`) = '2024-07-03' and `status` = 4
select count(*) as aggregate from `bookings` where date(`created_at`) = '2024-07-03' and `status` = 3
select count(*) as aggregate from `bookings` where `created_at` >= '2024-06-26 02:17:08'
select count(*) as aggregate from `bookings` where `created_at` >= '2024-06-26 02:17:08' and `status` = 0
select count(*) as aggregate from `bookings` where `created_at` >= '2024-06-26 02:17:08' and `status` = 1
select count(*) as aggregate from `bookings` where `created_at` >= '2024-06-26 02:17:08' and `status` = 2
select count(*) as aggregate from `bookings` where `created_at` >= '2024-06-26 02:17:08' and `status` = 4
select count(*) as aggregate from `bookings` where `created_at` >= '2024-06-26 02:17:08' and `status` = 3
select count(*) as aggregate from `bookings` where `created_at` >= '2024-06-03 02:17:08'
select count(*) as aggregate from `bookings` where `created_at` >= '2024-06-03 02:17:08' and `status` = 0
select count(*) as aggregate from `bookings` where `created_at` >= '2024-06-03 02:17:08' and `status` = 1
select count(*) as aggregate from `bookings` where `created_at` >= '2024-06-03 02:17:08' and `status` = 2
select count(*) as aggregate from `bookings` where `created_at` >= '2024-06-03 02:17:08' and `status` = 4
select count(*) as aggregate from `bookings` where `created_at` >= '2024-06-03 02:17:08' and `status` = 3
select count(*) as aggregate from `bookings` where `created_at` >= '2024-04-04 02:17:08'
select count(*) as aggregate from `bookings` where `created_at` >= '2024-04-04 02:17:08' and `status` = 0
select count(*) as aggregate from `bookings` where `created_at` >= '2024-04-04 02:17:08' and `status` = 1
select count(*) as aggregate from `bookings` where `created_at` >= '2024-04-04 02:17:08' and `status` = 2
select count(*) as aggregate from `bookings` where `created_at` >= '2024-04-04 02:17:08' and `status` = 4
select count(*) as aggregate from `bookings` where `created_at` >= '2024-04-04 02:17:08' and `status` = 3
select count(*) as aggregate from `bookings` where `created_at` >= '2024-01-05 02:17:08'
select count(*) as aggregate from `bookings` where `created_at` >= '2024-01-05 02:17:08' and `status` = 0
select count(*) as aggregate from `bookings` where `created_at` >= '2024-01-05 02:17:08' and `status` = 1
select count(*) as aggregate from `bookings` where `created_at` >= '2024-01-05 02:17:08' and `status` = 2
select count(*) as aggregate from `bookings` where `created_at` >= '2024-01-05 02:17:08' and `status` = 4
select count(*) as aggregate from `bookings` where `created_at` >= '2024-01-05 02:17:08' and `status` = 3
select count(*) as aggregate from `bookings`
select count(*) as aggregate from `bookings` where `status` = 0
select count(*) as aggregate from `bookings` where `status` = 1
select count(*) as aggregate from `bookings` where `status` = 2
select count(*) as aggregate from `bookings` where `status` = 3
select count(*) as aggregate from `bookings` where `status` = 4
select sum(`amount`) as aggregate from `platform_earning_history` where date(`created_at`) = '2024-07-03'
select sum(`amount`) as aggregate from `platform_earning_history` where `created_at` >= '2024-06-26 02:17:08'
select sum(`amount`) as aggregate from `platform_earning_history` where `created_at` >= '2024-06-03 02:17:08'
select sum(`amount`) as aggregate from `platform_earning_history` where `created_at` >= '2024-04-04 02:17:08'
select sum(`amount`) as aggregate from `platform_earning_history` where `created_at` >= '2024-01-05 02:17:08'
select sum(`amount`) as aggregate from `platform_earning_history`
select sum(`amount`) as aggregate from `user_withdraw_request` where `status` = 0
select sum(`amount`) as aggregate from `user_withdraw_request` where `status` = 1
select sum(`amount`) as aggregate from `user_withdraw_request` where `status` = 2
select sum(`amount`) as aggregate from `user_wallet_recharge_logs` where date(`created_at`) = '2024-07-03'
select sum(`amount`) as aggregate from `user_wallet_recharge_logs` where `created_at` >= '2024-06-26 02:17:08'
select sum(`amount`) as aggregate from `user_wallet_recharge_logs` where `created_at` >= '2024-06-03 02:17:08'
select sum(`amount`) as aggregate from `user_wallet_recharge_logs` where `created_at` >= '2024-04-04 02:17:08'
select sum(`amount`) as aggregate from `user_wallet_recharge_logs` where `created_at` >= '2024-01-05 02:17:08'
select sum(`amount`) as aggregate from `user_wallet_recharge_logs`
select sum(`amount`) as aggregate from `card_topups` where date(`created_at`) = '2024-07-03'
select sum(`amount`) as aggregate from `card_topups` where `created_at` >= '2024-06-26 02:17:08'
select sum(`amount`) as aggregate from `card_topups` where `created_at` >= '2024-06-03 02:17:08'
select sum(`amount`) as aggregate from `card_topups` where `created_at` >= '2024-04-04 02:17:08'
select sum(`amount`) as aggregate from `card_topups` where `created_at` >= '2024-01-05 02:17:08'
select sum(`amount`) as aggregate from `card_topups`
---
    function dashboard()
    {
        $settings = GlobalSettings::first();

        $cards = Card::whereNull('assigned_to')->get();
        $assigncards = Card::whereNotNull('assigned_to')->get();
        $users = Users::where('is_block', '!=', '1')->whereNull('card_id')->orderBy('first_name', 'asc')->get();

        $salonRequests = Salons::where('status', Constants::statusSalonPending)->count();
        $activeSalons = Salons::where('status', Constants::statusSalonActive)->count();
        $bannedSalons = Salons::where('status', Constants::statusSalonBanned)->count();
        $singUpOnlySalons = Salons::where('status', Constants::statusSalonSignUpOnly)->count();

        $todayTotalBookings = Bookings::whereDate('created_at', Carbon::now())->count();
        $todayTotalPendingBookings = Bookings::whereDate('created_at', Carbon::today())->where('status', Constants::orderPlacedPending)->count();
        $todayTotalAcceptedBookings = Bookings::whereDate('created_at', Carbon::today())->where('status', Constants::orderAccepted)->count();
        $todayTotalCompletedBookings = Bookings::whereDate('created_at', Carbon::today())->where('status', Constants::orderCompleted)->count();
        $todayTotalCancelledBookings = Bookings::whereDate('created_at', Carbon::today())->where('status', Constants::orderCancelled)->count();
        $todayTotalDeclinedBookings = Bookings::whereDate('created_at', Carbon::today())->where('status', Constants::orderDeclined)->count();

        $last7date = Carbon::now()->subDays(7);
        $last7daysTotalBookings = Bookings::where('created_at', '>=', $last7date)->count();
        $last7daysTotalPendingBookings = Bookings::where('created_at', '>=', $last7date)->where('status', Constants::orderPlacedPending)->count();
        $last7daysTotalAcceptedBookings = Bookings::where('created_at', '>=', $last7date)->where('status', Constants::orderAccepted)->count();
        $last7daysTotalCompletedBookings = Bookings::where('created_at', '>=', $last7date)->where('status', Constants::orderCompleted)->count();
        $last7daysTotalCancelledBookings = Bookings::where('created_at', '>=', $last7date)->where('status', Constants::orderCancelled)->count();
        $last7daysTotalDeclinedBookings = Bookings::where('created_at', '>=', $last7date)->where('status', Constants::orderDeclined)->count();

        $last30date = Carbon::now()->subDays(30);
        $last30daysTotalBookings = Bookings::where('created_at', '>=', $last30date)->count();
        $last30daysTotalPendingBookings = Bookings::where('created_at', '>=', $last30date)->where('status', Constants::orderPlacedPending)->count();
        $last30daysTotalAcceptedBookings = Bookings::where('created_at', '>=', $last30date)->where('status', Constants::orderAccepted)->count();
        $last30daysTotalCompletedBookings = Bookings::where('created_at', '>=', $last30date)->where('status', Constants::orderCompleted)->count();
        $last30daysTotalCancelledBookings = Bookings::where('created_at', '>=', $last30date)->where('status', Constants::orderCancelled)->count();
        $last30daysTotalDeclinedBookings = Bookings::where('created_at', '>=', $last30date)->where('status', Constants::orderDeclined)->count();

        $last90date = Carbon::now()->subDays(90);
        $last90daysTotalBookings = Bookings::where('created_at', '>=', $last90date)->count();
        $last90daysTotalPendingBookings = Bookings::where('created_at', '>=', $last90date)->where('status', Constants::orderPlacedPending)->count();
        $last90daysTotalAcceptedBookings = Bookings::where('created_at', '>=', $last90date)->where('status', Constants::orderAccepted)->count();
        $last90daysTotalCompletedBookings = Bookings::where('created_at', '>=', $last90date)->where('status', Constants::orderCompleted)->count();
        $last90daysTotalCancelledBookings = Bookings::where('created_at', '>=', $last90date)->where('status', Constants::orderCancelled)->count();
        $last90daysTotalDeclinedBookings = Bookings::where('created_at', '>=', $last90date)->where('status', Constants::orderDeclined)->count();

        $last180date = Carbon::now()->subDays(180);
        $last180daysTotalBookings = Bookings::where('created_at', '>=', $last180date)->count();
        $last180daysTotalPendingBookings = Bookings::where('created_at', '>=', $last180date)->where('status', Constants::orderPlacedPending)->count();
        $last180daysTotalAcceptedBookings = Bookings::where('created_at', '>=', $last180date)->where('status', Constants::orderAccepted)->count();
        $last180daysTotalCompletedBookings = Bookings::where('created_at', '>=', $last180date)->where('status', Constants::orderCompleted)->count();
        $last180daysTotalCancelledBookings = Bookings::where('created_at', '>=', $last180date)->where('status', Constants::orderCancelled)->count();
        $last180daysTotalDeclinedBookings = Bookings::where('created_at', '>=', $last180date)->where('status', Constants::orderDeclined)->count();

        $allTimeTotalBookings = Bookings::count();
        $allTimeTotalPendingBookings = Bookings::where('status', Constants::orderPlacedPending)->count();
        $allTimeTotalAcceptedBookings = Bookings::where('status', Constants::orderAccepted)->count();
        $allTimeTotalCompletedBookings = Bookings::where('status', Constants::orderCompleted)->count();
        $allTimeTotalDeclinedBookings = Bookings::where('status', Constants::orderDeclined)->count();
        $allTimeTotalCancelledBookings = Bookings::where('status', Constants::orderCancelled)->count();

        $todayEarnings = PlatformEarningHistory::whereDate('created_at', Carbon::now())->sum('amount');
        $last7DaysEarnings = PlatformEarningHistory::where('created_at', '>=', $last7date)->sum('amount');
        $last30DaysEarnings = PlatformEarningHistory::where('created_at', '>=', $last30date)->sum('amount');
        $last90DaysEarnings = PlatformEarningHistory::where('created_at', '>=', $last90date)->sum('amount');
        $last180DaysEarnings = PlatformEarningHistory::where('created_at', '>=', $last180date)->sum('amount');
        $allTimeDaysEarnings = PlatformEarningHistory::sum('amount');

        $pendingSalonPayouts = SalonPayoutHistory::where('status', 0)->sum('amount');
        $completedSalonPayouts = SalonPayoutHistory::where('status', 1)->sum('amount');
        $pendingUserPayouts = UserWithdrawRequest::where('status', 0)->sum('amount');
        $completedUserPayouts = UserWithdrawRequest::where('status', 1)->sum('amount');
        $rejectedUserPayouts = UserWithdrawRequest::where('status', 2)->sum('amount');

        $todayRecharges = UserWalletRechargeLogs::whereDate('created_at', Carbon::now())->sum('amount');
        $last7DaysRecharges = UserWalletRechargeLogs::where('created_at', '>=', $last7date)->sum('amount');
        $last30DaysRecharges = UserWalletRechargeLogs::where('created_at', '>=', $last30date)->sum('amount');
        $last90DaysRecharges = UserWalletRechargeLogs::where('created_at', '>=', $last90date)->sum('amount');
        $last180DaysRecharges = UserWalletRechargeLogs::where('created_at', '>=', $last180date)->sum('amount');
        $allTimeRecharges = UserWalletRechargeLogs::sum('amount');

        $todayTopups = CardTopup::whereDate('created_at', Carbon::now())->sum('amount');
        $last7DaysTopups = CardTopup::where('created_at', '>=', $last7date)->sum('amount');
        $last30DaysTopups = CardTopup::where('created_at', '>=', $last30date)->sum('amount');
        $last90DaysTopups = CardTopup::where('created_at', '>=', $last90date)->sum('amount');
        $last180DaysTopups = CardTopup::where('created_at', '>=', $last180date)->sum('amount');
        $allTimeTopups = CardTopup::sum('amount');