app/Http/Controllers/Admin/AdminChatController.php

select * from `users` order by `last_message_time` desc
select * from `global_settings` limit 1
---
    public function chat(){
        $users = Users::orderBy('last_message_time', 'desc')->get();
        $settings = GlobalSettings::first();

select * from `admin_user` where `user_name` = 'admin' limit 1
update `chat_messages` set `read` = 1, `chat_messages`.`updated_at` = '2024-07-03 03:06:38' where (`sender` = 1 and `receiver` = '1')
update `chat_messages` set `read` = 1, `chat_messages`.`updated_at` = '2024-07-03 07:01:08' where (`sender` = 1 and `receiver` = '1')
select * from `chat_messages` where (`sender` = '1' and `receiver` = 1) or (`sender` = 1 and `receiver` = '1')
---
    public function get_message(Request $request, $userid)
    {
        $admin = DB::table('admin_user')->where('user_name', session()->get('user_name'))->first();
        $my_id = $admin->user_id;

        ChatMessage::where(['sender' => $userid, 'receiver' => $my_id])->update(['read' => 1]);
        ChatMessage::where(['sender' => $my_id, 'receiver' => $userid])->update(['read' => 1]);

        $messages = ChatMessage::where(function ($query) use ($userid, $my_id) {
            $query->where('sender', $userid)->where('receiver', $my_id);
        })->oRwhere(function ($query) use ($userid, $my_id) {
            $query->where('sender', $my_id)->where('receiver', $userid);
        })->get();

select * from `admin_user` where `user_name` = 'admin' limit 1
insert into `chat_messages` (`sender`, `receiver`, `message`, `read`, `sender_type`, `updated_at`, `created_at`) values (1, '1', 'ok', '0', 'admin', '2024-07-03 07:01:22', '2024-07-03 07:01:22')
update `users` set `last_message_time` = '2024-07-03 07:01:22', `users`.`updated_at` = '2024-07-03 07:01:22' where `id` = '1'
select * from `global_settings` limit 1
---
    public function send_message(Request $request)
    {
        $admin = DB::table('admin_user')->where('user_name', session()->get('user_name'))->first();

        $sender = $admin->user_id;
        $receiver =  $request->receiver_id;
        $message = $request->message;

        $rs = ChatMessage::create([
            'sender' => $sender,
            'receiver' => $receiver,
            'message' => $message,
            'read' => '0',
            'sender_type' => 'admin'
        ]);

        User::where('id', $receiver)->update(['last_message_time' => date('Y-m-d H:i:s')]);

        $settings = GlobalSettings::first();