app/Http/Controllers/Admin/BookingsController.php

    public function booking_invoice($id)
    {
        $booking = Bookings::where('id', $id)->first();
        $user = Users::where('id', $booking->user_id)->first();
        $service = Services::where('id', $booking->service_id)->first();
        $tax = Taxes::where('id', '1')->first();
        $settings = GlobalSettings::first();
---
select * from `bookings` where `id` = '60' limit 1
select * from `users` where `id` = 2 limit 1
select * from `taxes` where `id` = '1' limit 1
select * from `global_settings` limit 1