app/Http/Controllers/Admin/DepositsController.php

    function user_wallet_topup(Request $request)
    {
        $rules = [
            'user_id' => 'required',
            'amount' => 'required',
            'transaction_id' => 'required',
            'transaction_summary' => 'required',
        ];

        $validator = Validator::make($request->all(), $rules);
        if ($validator->fails()) {
            $messages = $validator->errors()->all();
            $msg = $messages[0];
            return response()->json(['status' => false, 'message' => $msg]);
        }

        $settings = GlobalSettings::first();

        $user = Users::find($request->user_id);
        if ($user == null) {
            return response()->json(['status' => false, 'message' => "User doesn't exists!"]);
        }

        $fee=Fee::where('type','deposit')->first();
---
select * from `global_settings` limit 1
select * from `users` where `users`.`id` = '1' limit 1
select * from `fees` where `type` = 'deposit' limit 1

        $charge_amount=($request->amount*$fee->charge_percent)/100;

        $user->wallet = $user->wallet + $request->amount;
        $user->save();
---
update `users` set `wallet` = 19514.96, `users`.`updated_at` = '2024-07-03 08:57:32' where `id` = 1


        try{

            $wallet_details=UserWalletStatements::where('user_id',$user->id)->latest()->first();
---
select * from `user_wallet_statement` where `user_id` = 1 order by `created_at` desc limit 1

            $charge_amount= $settings->currency.number_format($charge_amount,2);
            $total_amount= $settings->currency.number_format($total_amount,2);

            $check_device = Device::where('user_id', $user->id)->first();
---
select * from `devices` where `user_id` = 1 limit 1

                $act_lang = '1';
            }

            $email_template = EmailTemplate::find(4);
---
select * from `email_template` where `email_template`.`id` = 4 limit 1

            send_email($details);

            $superAdmin=Admin::where('user_type',1)->first();
            $bookingsuccesemail=AdminEmailTemplate::find(4);
---
select * from `admin_email_template` where `admin_email_template`.`id` = 4 limit 1


            $type="add_fund";

            $notification_template = NotificationTemplate::find(1);
---
select * from `notification_template` where `notification_template`.`id` = 1 limit 1


            GlobalFunction::sendPushToUser($title, $message, $user);

            $adminNotification=AdminNotificationTemplate::find(1);
---
select * from `admin_notification_template` where `admin_notification_template`.`id` = 1 limit 1