app/Http/Controllers/Admin/MaintainanceController.php

select * from `languages`
select * from `maintenance_settings` order by `id` desc
---
    public function index()
    {
        $data['languages'] = Language::get();
        $data['settings'] = MaintenanceSetting::orderBy('id', 'desc')->get();

select * from `languages`
select * from `maintenance_settings` where `id` = '1' limit 1
---
    public function edit($id)
    {
        $data['languages'] = Language::get();
        $data['maintainance'] = MaintenanceSetting::where('id', $id)->first();

update `maintenance_settings` set `subject_en` = 'Maintenance Break', `subject_pap` = '', `subject_nl` = '', `date` = '2024-07-03', `from_time` = '02:25', `to_time` = '02:45', `message_en` = 'We are unnder maintenance', `message_pap` = '', `message_nl` = '', `type` = '1', `maintenance_settings`.`updated_at` = '2024-07-03 02:40:29' where `id` = '2'
---
    public function update(Request $request, $id)
    {
        $rs = MaintenanceSetting::where('id', $id)->update([
            'subject_en' => $request->subject_en,
            'subject_pap' => $request->subject_pap,
            'subject_nl' => $request->subject_nl,
            'date' => $request->date,
            'from_time' => $request->from_time,
            'to_time' => $request->to_time,
            'message_en' => $request->message_en,
            'message_pap' => $request->message_pap,
            'message_nl' => $request->message_nl,
            'type' => $request->type,
        ]);