app/Http/Controllers/Admin/SalonController.php

select * from `salon_bank_accounts` where `salon_bank_accounts`.`salon_id` in (1)
select * from `salon` where `salon`.`id` = '1' limit 1
select * from `global_settings` limit 1
select * from `salon_categories` where `id` in ('') order by `sort` asc
select * from `bookings` where `status` = 1
select * from `bookings` where `status` = 2
select * from `bookings` where `status` = 4
select * from `salon_booking_slots` where `salon_id` = '1'
---
    function edit($salonId)
    {
        $salon = Salons::with(['images', 'bankAccount'])->find($salonId);
        $settings = GlobalSettings::first();
        $salonCats = SalonCategories::whereIn('id', explode(',', $salon->salon_categories))->orderBy('sort','asc')->get();
        $salon->mon_fri_from = GlobalFunction::formateTimeString($salon->mon_fri_from);
        $salon->mon_fri_to = GlobalFunction::formateTimeString($salon->mon_fri_to);
        $salon->sat_sun_from = GlobalFunction::formateTimeString($salon->sat_sun_from);
        $salon->sat_sun_to = GlobalFunction::formateTimeString($salon->sat_sun_to);

        $total_accepted=Bookings::where('status',1)->get()->count();
        $total_completed=Bookings::where('status',2)->get()->count();
         $total_cancelled=Bookings::where('status',4)->get()->count();

        $slots = SalonBookingSlots::where('salon_id', $salonId)->get();