app/Http/Controllers/Admin/ServiceController.php

select * from `salon_service_images` where `salon_service_images`.`service_id` in (55)
---
    function store(Request $request)
    {
        $service = Services::find($request->id);
        $service->status = '1';
        $service->save();

        $del_service = Services::where('status', '2')->get();
        foreach($del_service as $del){
            $serviceImages = ServiceImages::where('service_id', $del->id)->get();

select * from `salon` where `salon`.`id` in (1)
select * from `salon_categories` where `is_deleted` = 0
select * from `global_settings` limit 1
select * from `salon_booking_slots` where `salon_id` = '55' order by `time` asc
---
    function edit($id)
    {
        $service = Services::with(['images', 'salon'])->find($id);
        $categories = SalonCategories::where('is_deleted', 0)->get();
        $settings = GlobalSettings::first();
        $slots = SalonBookingSlots::where('salon_id', $id)->orderBy('time','ASC')->get();