app/Http/Controllers/Admin/SettingsController.php

select * from `global_settings` limit 1
---
    function index(Request $request)
    {
        $settings = GlobalSettings::first();

select * from `global_settings` limit 1
---
    function update(Request $request)
    {
        $settings = GlobalSettings::first();

select * from `global_settings` limit 1
select * from `email_configs` limit 1
---
    function email_settings(Request $request)
    {
        $settings = GlobalSettings::first();
        $email = EmailConfig::first();

select * from `email_configs` limit 1
---
    public function email_settings_update(Request $request)
    {
        $admin = Admin::where('user_name', session()->get('user_name'))->first();

        $settings = EmailConfig::first();

select * from `email_configs` limit 1
---
                $message->subject($data['subject']);
            });

            $emailConfig = EmailConfig::first();