app/Http/Controllers/Admin/UserController.php

    function profile($id)
    {
        $user = Users::find($id);
        $settings = GlobalSettings::first();
        $totalBookings = Bookings::where('user_id', $id)->count();

        if($user->user_type==1){
            $services = Services::select(['id','latitude','logintude','salon_id','category_id','rating','thumbnail','title','service_time','service_number','about','rules','qauntity','foreiner_price as price','foreiner_price_per_day as price_per_day','foreiner_discount as discount'])->where('status',1)->get();
        }else{
            $services = Services::select(['id','latitude','logintude','salon_id','category_id','thumbnail','rating','title','service_time','service_number','about','rules','qauntity','price','price_per_day','discount'])->where('status',1)->get();
        }

        $ibpcards = Card::where('assigned_to', $id)->first();
---
select * from `users` where `users`.`id` = '1' limit 1
select * from `global_settings` limit 1
select count(*) as aggregate from `bookings` where `user_id` = '1'
select * from `cards` where `assigned_to` = '1' limit 1